** Hello World

#+BEGIN_SRC rustic
fn main() {
    println!("Hello, World!");
}  
#+END_SRC

#+RESULTS:
: Hello, World!

** Hello KC Ruby

#+BEGIN_SRC rustic
  fn main() {
      let name = "KC Ruby";
      println!("Hello, {}!", name);
  }
#+END_SRC

#+RESULTS:
: Hello, KC Ruby!

** Variables
- Types must be declared for constants
- Variables are immutable by default

#+BEGIN_SRC rustic
const FAVENUM: u32 = 12;

fn main() {
    let my_name = "Ben";
    let mut my_age = 29;
}
#+END_SRC

#+RESULTS:
: error: Could not compile `cargoqM4uIx`.

*** Iteration

#+BEGIN_SRC rustic
  fn main() {
      let arr = [10, 20, 30, 40, 50];

      for element in arr.iter() {
	  println!("the value is: {}", element);
      }
  }
  
fn 
#+END_SRC

#+RESULTS:
: the value is: 10
: the value is: 20
: the value is: 30
: the value is: 40
: the value is: 50

** Functions
#+BEGIN_SRC rustic
  fn fib(n: u32) -> u32 {
      if n < 2 {
	  n
      } else {
	  fib(n - 1) + fib(n - 2)
      }
  }
  
  fn say_hello(name: &str) {
      println!("Hello, ", name);
  }

  fn main() {
      let x = 10;
      let result = fib(x);
      println!("{}", result);
  }
#+END_SRC

#+RESULTS:
: 55
 
